In [1]:
from common.explore import display_sql

In [2]:
display_sql(f'''
SELECT *
  FROM curated.job_location
 ORDER BY load_timestamp DESC
 LIMIT 10
''')

    job_id      load_timestamp         location day month  year
0  8773209 2022-10-02 21:00:00       Wangerooge   2    10  2022
1  8773210 2022-10-02 21:00:00          Hamburg   2    10  2022
2  8773211 2022-10-02 21:00:00          Hamburg   2    10  2022
3  8773212 2022-10-02 21:00:00           Oppurg   2    10  2022
4  8773213 2022-10-02 21:00:00           Oppurg   2    10  2022
5  8773214 2022-10-02 21:00:00     Unterföhring   2    10  2022
6  8773215 2022-10-02 21:00:00         Mettmann   2    10  2022
7  8773216 2022-10-02 21:00:00     Wyk auf Föhr   2    10  2022
8  8773217 2022-10-02 21:00:00      Taunusstein   2    10  2022
9  8773218 2022-10-02 21:00:00  Bad Reichenhall   2    10  2022

In [3]:
display_sql(f'''
SELECT *
 FROM dim_job_location
ORDER BY job_ldts DESC
LIMIT 10
''')

,job_key,job_id,job_ldts,location_name
0,2284064cc9722eedee78de0c83aaab97,8773209,2022-10-02 21:00:00,Wangerooge
1,daac9fccfeafb13d2dfa142851a85407,8773210,2022-10-02 21:00:00,Hamburg
2,0d7360738d7b1591354958577eff3c12,8773211,2022-10-02 21:00:00,Hamburg
3,bd861b60fa66c019a79c989e34567d0f,8773212,2022-10-02 21:00:00,Oppurg
4,40cd7a2bebdcc033d1e36525f88769ca,8773213,2022-10-02 21:00:00,Oppurg
5,208e478152134a4578a416db5db25315,8773214,2022-10-02 21:00:00,Unterföhring
6,b22e754e0b9e40019c5d37a5f763920f,8773215,2022-10-02 21:00:00,Mettmann
7,c5e88d3478f4eb46910aec45bcba2973,8773216,2022-10-02 21:00:00,Wyk auf Föhr
8,1afb1a14faaa7e972d2733e83417e33f,8773217,2022-10-02 21:00:00,Taunusstein
9,842e99e8a93d288b19e0651814fdc607,8773218,2022-10-02 21:00:00,Bad Reichenhall